# Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

S = int(input('Введите количество журавликов: '))
P = int (S/6)
K = int (S/6*4)
C = int (S/6)
if (S % 6 == 0):
    print(f'Петя сделал {P} журавлика(ов), Катя - {K}, а Сережа - {C}')
else:
    print(f'Такое количество журавликов противоречит условию задачи')

